
[
    {
        "id":"saz",
        "title":"Software Developer Intern / Project Manager at SAZ Tech",
        "time":"July 2025 - Present",
        "logo":"/profile/images/saz-logo.png",
        "description":"As a Software Developer Intern / Project Manager at SAZ Tech, I handle development and management tasks. I attend meetings with clients sharing updates on projects and take in their questions and next steps. I collaborate daily on cross-functional teams with developers, clients, and other managers. I also utilize Zoho suite to build custome applications for clients. Thirdly, I have the opportunity to learn more about different roles in the company which expand my horizons on business operations.",
        "skills": ["Python", "Zoho Suite", "Management", "Communication", "Organized"]
    },
    {
        "id":"juni",
        "title":"Instructor at Juni Learning",
        "time":"May 2021 - April 2025",
        "logo":"/profile/images/juni-learning-logo.png",
        "description":"As a Computer Science Instructor at Juni Learning, I taught programming and computer  science concepts to students aged 8-18 through customized one-on-one sessions. I covered languages  such as Python, Java, and C++, as well as concepts like algorithms and data structures. I provided  personalized feedback to help students develop problem-solving skills, debug code, and complete  projects. I adapted my teaching to individual learning styles and maintained regular communication  with parents.",
        "skills": ["Python", "Java", "C++", "JavaScript", "HTML/CSS"]
    },
    {
        "id":"smuhsd",
        "title":"Substitute Teacher at San Mateo Union High School District",
        "time":"November 2024 - Present",
        "logo":"/profile/images/SMHUSDLogo.png",
        "description":"As a Substitute Teacher, I have consistently demonstrated the ability to manage diverse classrooms across various subjects, cultivating an engaging and productive learning environment for high school students. I excel in quickly assessing and adapting to the unique dynamics of each class, ensuring the effective implementation of lesson plans while maintaining classroom discipline. My strong communication skills, coupled with my adaptability, enable me to seamlessly integrate into new educational settings, ensuring that instructional goals are met in the absence of regular staff. Whether managing pre-planned lessons or addressing unforeseen challenges, I remain committed to fostering an inclusive and supportive atmosphere that promotes both academic achievement and personal growth for students.",
        "skills": ["Adaptable", "Management", "Organized"]
    },
    {
        "id":"trc",
        "title":"Assistant at the Transit Research Center of UC Davis",
        "time":"October 2023 - June 2024",
        "logo":"/profile/images/trc-logo.jpg",
        "description":"As an Assistant at the UC Davis Transit Research Center, I helped redesign and maintain the center's website to improve communication with researchers and the public. I collaborated with cross-functional teams to create engaging, user-friendly content, summarized research projects, and incorporated interactive elements to enhance audience engagement. My work ensured that the website was visually appealing, accessible, and aligned with the center’s goals.",
        "skills": ["SiteFarm", "documentation", "cross-functional teams"]
    }
]